Repository: nmeilick/gli-gettext
Catalog: lib/po/*/gli-lib.po
Languages: de

source: Show this message
de: Zeige diesen Hilfetext

source: in global options
de: in globalen Optionen

source: error: %{message}
de: Fehler: %{message}

source: Use '%{app} help' for a list of commands
de: Verwende '%{app} help' für eine Befehlsliste

source: Use '%{app} help %{command}' for a list of command options
de: Verwende '%{app} help %{command}' für eine Liste der Befehlsoptionen

source: Use '%{app} help' for a list of global options
de: Verwende '%{app} help' für eine Liste aller globalen Optionen

source: Unknown command '%{command}'
de: Unbekannter Befehl '%{command}'

source: Unknown option %{option}
de: Unbekannte Option %{option}

source: %{name} has already been specified as a %{type} %{context}
de: %{name} wurde bereits als %{type} %{context} spezifiziert

source: %{name} has already been specified as an alias of %{type} %{one_option_name} %{context}
de: %{name} wurde bereits als ein Alias von %{type} %{one_option_name} %{context} spezifiziert

source: [command options]
de: [Befehlsoptionen]

source: in command %{command}
de: in Befehl %{command}

source: %{name} has spaces; they are not allowed
de: %{name} enthält Leerzeichen: diese sind nicht erlaubt

source: %{arg} requires an argument
de: %{arg} benötigt ein Argument

source: %{arg} requires an argument via %{arg}=argument
de: %{arg} benötigt ein Argument via %{arg}=Argument

source: Shows list of commands or help for one command
de: Zeige eine Befehlsliste oder einen Hilfetext für einen Befehl

source: [command]
de: [Befehl]

source: Gets help for the application or its commands. Can also list the commands in a way helpful to creating a bash-style completion function
de: Zeigt den Hilfetext der Anwendung oder seiner Befehle an. Die Befehle können dabei auch auf eine Art und Weise angezeigt werden, die bei der Erzeugung von bash-artigen Komplettierungsfunktionen hilft

source: List all commands one line at a time, for use with shell completion ([command] argument is partial command to match)
de: Listet alle Befehle zeilenweise für die Benutzung durch Shell Komplettierungsfunktionen auf ([Befehl] Argument ist ein Teil des jeweiligen Befehlsnamens)

source: usage: %{app}
de: Syntax: %{app}

source: [global options]
de: [Globale Optionen]

source: command
de: Befehl

source: Global Options:
de: Globale Optionen:

source: Commands:
de: Befehle:

source: Command Options:
de: Befehlsoptionen:

source: No such command %{command}
de: Unbekannter Befehl %{command}

source: (default: %{default})
de: (Standard: %{default})

source: Initialize the config file using current global options
de: Initialisiere die Konfigurationsdatei mittels der aktuellen globalen Optionen

source: force overwrite of existing config file
de: Erzwinge das Überschreiben bestehender Konfigurationsdateien

source: Not overwriting existing config file %{file}, use --force to override
de: Überschreibe bestehende Konfigurationsdatei %{file} nicht, verwende --force um die Datei zu überschreiben.

source: Create a very basic scaffold for a cheat-style cheatsheet, in addition to rdoc
de: Erzeuge zusätzlich zum rdoc ein einfaches Gerüst für ein Cheatsheet

source: Include a manapage suitable for gem man, in addition to rdoc
de: Erzeuge zusätzlich zum rdoc eine für gem man geeignete Manpage

source: Do not create rdoc
de: Erzeuge kein rdoc

source: command_name
de: befehlsname

source: [command-specific options]
de: [befehlsspezifische-Optionen]

source: arguments...
de: Argumente...

source: * Use the command +help+ to get a summary of commands
de: * Verwende den Befehl +help+ um eine Befehlsübersicht zu erhalten

source: * Use the command <tt>help command_name</tt> to get a help for +command_name+
de: * Verwende den Befehl <tt>help befehlsname</tt> um Hilfe für +befehlsname+ zu erhalten

source: * Use <tt>--</tt> to stop command line argument processing; useful if your arguments have dashes in them
de: * Verwende <tt>--</tt> um die Kommandozeilenparameterverarbeitung zu beenden; hilfreich wenn die Argumente mit Bindestrichen beginnen

source: == Global Options
de: == Globale Optionen

source: These options are available for any command and are specified before the name of the command
de: Diese Optionen sind für alle Befehle verfügbar und werden vor dem Befehlsnamen angegeben

source: == Commands
de: == Befehle

source: *Aliases*
de: *Aliase*

source: ==== Options
de: ==== Optionen

source: These options are specified *after* the command.
de: Diese Optionen werden *nach* dem Befehl angegeben.

source: Describe your project here
de: Deine Projektbeschreibung

source: Created %{path}
de: Erzeugt %{path}

source: Generate this with %{project_name} rdoc After you have described your command line interface
de: Erzeuge dies mittels %{project_name} rdoc nachdem Du das Kommandozeileninterface beschrieben hast

source: %{file} exists, use --force to override
de: Datei %{file} existiert, verwende --force um sie zu überschreiben

source: %{path} exists, use --force to override
de: Verzeichnis %{path} existiert, verwende --force um dieses zu überschreiben

source: Creating directory %{path}...
de: Erzeuge Verzeichnis %{path}...

source: dry-run; %{path} not created
de: Testlauf; %{path} nicht erzeugt

source: Exiting...
de: Beende...
